app/controllers/api/v1/entries_controller.rb

			def index
				entries = Entry.order('created_at DESC')
---
SELECT "entries".* FROM "entries" ORDER BY created_at DESC

			def create
				entry = Entry.new(entry_params)
				if entry.save
---
INSERT INTO "entries" ("feeding_day", "watering_day", "defoil", "training_applied", "water_ph_levels", "soil_ph_levels", "nutrients_used", "temp", "relative_humidity", "explanation", "notes", "journal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

			def update
				entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]