app/controllers/api/v1/gardens_controller.rb

SELECT "gardens".* FROM "gardens" ORDER BY created_at DESC
---
			def index
				gardens = Garden.order('created_at DESC')

SELECT "gardens".* FROM "gardens" WHERE "gardens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
			def show
				garden = Garden.find(params[:id])

INSERT INTO "gardens" ("garden_name", "garden_type", "garden_medium", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["garden_name", "Closet Tent"], ["garden_type", "Medicinal"], ["garden_medium", "Soil"], ["created_at", "2020-03-31 22:00:31.539069"], ["updated_at", "2020-03-31 22:00:31.539069"]]
---
			def create
				garden = Garden.new(garden_params)
				if garden.save

SELECT "gardens".* FROM "gardens" WHERE "gardens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gardens" SET "garden_name" = $1, "updated_at" = $2 WHERE "gardens"."id" = $3  [["garden_name", "Indoor Tent"], ["updated_at", "2020-03-31 22:06:46.430435"], ["id", 1]]
---
			def update
				garden = Garden.find(params[:id])
				if garden.update_attributes(garden_params)

SELECT "gardens".* FROM "gardens" WHERE "gardens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gardens" WHERE "gardens"."id" = $1  [["id", 1]]
---
			def destroy
				garden = Garden.find(params[:id])
				if garden.destroy