app/controllers/api/v1/journals_controller.rb

			def index
				journals = Journal.order('created_at DESC')
---
SELECT "journals".* FROM "journals" ORDER BY created_at DESC

			def show
				journal = Journal.find(params[:id])
---
SELECT "journals".* FROM "journals" WHERE "journals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

			def create
				journal = Journal.new(journal_params)
				if journal.save
---
INSERT INTO "journals" ("journal_name", "journal_type", "archive", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["journal_name", "Closet Grow"], ["journal_type", "Tracking"], ["archive", false], ["created_at", "2020-04-01 19:00:11.262214"], ["updated_at", "2020-04-01 19:00:11.262214"]]

			def update
				journal = Journal.find(params[:id])
				if journal.update_attributes(journal_params)
---
SELECT "journals".* FROM "journals" WHERE "journals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "journals" SET "journal_type" = $1, "archive" = $2, "updated_at" = $3 WHERE "journals"."id" = $4  [["journal_type", "Tracking Errors"], ["archive", true], ["updated_at", "2020-04-01 19:03:25.112842"], ["id", 2]]

			def destroy
				journal = Journal.find(params[:id])
				if journal.destroy
---
SELECT "journals".* FROM "journals" WHERE "journals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "journals" WHERE "journals"."id" = $1  [["id", 1]]