app/controllers/api/v1/plants_controller.rb

SELECT "plants".* FROM "plants" ORDER BY created_at DESC
---
			def index
				plants = Plant.order('created_at DESC')

INSERT INTO "plants" ("plant_name", "plant_type", "growth_state", "flowering", "garden_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
			def create
				plant = Plant.new(plant_params)
				if plant.save

SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "plants" WHERE "plants"."id" = $1  [["id", 1]]
---
			def destroy
				plant = Plant.find(params[:id])
				if plant.destroy