app/controllers/api/v1/users_controller.rb

			def index
				users = User.order('created_at DESC')
---
SELECT "users".* FROM "users" ORDER BY created_at DESC

			def create
				user = User.new(user_params)
				if user.save
---
INSERT INTO "users" ("username", "gardening_experience", "nickname", "preferred_pronoun", "favorite_plant", "pref_gardening_medium", "country", "state_or_province", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

			def update
				user = User.find(params[:id])
				if user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "user_email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_email", "chris@c.com"], ["updated_at", "2020-03-31 17:19:27.029339"], ["id", 1]]